Repository: filippofinke/cad-studio
Catalog: CADStudio/Resources/Localizable.xcstrings
Source language: it
Languages: de, en, fr

source: L’agente adatta spessori, giochi e consigli di stampa alla tua stampante e usa l’unità scelta nelle risposte e nella tavola. I file STL e 3MF restano sempre in millimetri.
de: Der Agent passt Wandstärken, Spiel und Drucktipps an deinen Drucker an und verwendet die gewählte Einheit in Antworten und in der Zeichnung. STL- und 3MF-Dateien bleiben immer in Millimetern.
en: The agent adapts wall thicknesses, clearances and printing tips to your printer and uses the chosen unit in replies and in the drawing. STL and 3MF files are always in millimeters.
fr: L’agent adapte les épaisseurs, les jeux et les conseils d’impression à votre imprimante et utilise l’unité choisie dans les réponses et le dessin. Les fichiers STL et 3MF restent toujours en millimètres.

source: L’agente non ha ancora preparato il piatto di stampa: le parti sono affiancate senza ruotarle. Chiedi di prepararlo nella chat.
de: Der Agent hat die Druckplatte noch nicht vorbereitet: Die Teile liegen unrotiert nebeneinander. Bitte im Chat darum.
en: The agent hasn't prepared the print plate yet: the parts are placed side by side without rotating them. Ask for it in the chat.
fr: L’agent n’a pas encore préparé le plateau d’impression : les pièces sont posées côte à côte sans rotation. Demandez-le dans le chat.

source: L’ambiente Python esiste ma build123d o matplotlib non si importano.
de: Die Python-Umgebung ist vorhanden, aber build123d oder matplotlib lassen sich nicht importieren.
en: The Python environment exists, but build123d or matplotlib can’t be imported.
fr: L’environnement Python existe, mais build123d ou matplotlib ne peuvent pas être importés.

source: L’animazione ha collisioni tra parti in %lld fotogrammi
de: Die Animation hat in %lld Frames Kollisionen zwischen Teilen
en: The animation has collisions between parts in %lld frames
fr: L’animation présente des collisions entre pièces dans %lld images

source: L’esecuzione di model.py non riesce con questo errore. Correggi lo script: ``` %@ ```
de: Die Ausführung von model.py schlägt mit diesem Fehler fehl. Korrigiere das Skript: ``` %@ ```
en: Running model.py fails with this error. Fix the script: ``` %@ ```
fr: L’exécution de model.py échoue avec cette erreur. Corrige le script : ``` %@ ```

source: Medio
de: Mittel
en: Medium
fr: Moyen

source: Metri (m)
de: Meter (m)
en: Meters (m)
fr: Mètres (m)

source: Millimetri (mm)
de: Millimeter (mm)
en: Millimeters (mm)
fr: Millimètres (mm)

source: Misura
de: Messen
en: Measure
fr: Mesurer

source: Misura la distanza tra due punti
de: Abstand zwischen zwei Punkten messen
en: Measure the distance between two points
fr: Mesurer la distance entre deux points

source: Modello
de: Modell
en: Model
fr: Modèle

source: Modello generato
de: Modell erzeugt
en: Model generated
fr: Modèle généré

source: Modello non leggibile
de: Modell nicht lesbar
en: Model can’t be read
fr: Modèle illisible

source: Modello:
de: Modell:
en: Model:
fr: Modèle :

source: Modifica il modello
de: Bearbeitet das Modell
en: Editing the model
fr: Modifie le modèle

source: Modifica un file di supporto
de: Bearbeitet eine Hilfsdatei
en: Editing a helper file
fr: Modifie un fichier auxiliaire

source: Montato
de: Montiert
en: Assembled
fr: Assemblé

source: Mostra
de: Einblenden
en: Show
fr: Afficher

source: Mostra %@
de: %@ einblenden
en: Show %@
fr: Afficher %@

source: Mostra chat
de: Chat einblenden
en: Show Chat
fr: Afficher la discussion

source: Mostra dettagli
de: Details einblenden
en: Show Details
fr: Afficher les détails

source: Mostra il wireframe
de: Drahtgitter einblenden
en: Show wireframe
fr: Afficher le fil de fer

source: Mostra la griglia
de: Raster einblenden
en: Show grid
fr: Afficher la grille

source: Mostra le parti
de: Teile einblenden
en: Show parts
fr: Afficher les pièces

source: Mostra nel Finder
de: Im Finder zeigen
en: Show in Finder
fr: Afficher dans le Finder

source: Mostra o nascondi i parametri (⌥⌘I)
de: Parameter ein- oder ausblenden (⌥⌘I)
en: Show or hide parameters (⌥⌘I)
fr: Afficher ou masquer les paramètres (⌥⌘I)

source: Mostra o nascondi la chat
de: Chat ein- oder ausblenden
en: Show or hide the chat
fr: Afficher ou masquer la discussion

source: Mostra o nascondi la chat (⌘0)
de: Chat ein- oder ausblenden (⌘0)
en: Show or hide the chat (⌘0)
fr: Afficher ou masquer la discussion (⌘0)

source: Mostra parametri
de: Parameter einblenden
en: Show Parameters
fr: Afficher les paramètres

source: Mostra tutto
de: Alles anzeigen
en: Show All
fr: Tout afficher

source: Mostra una sezione del modello
de: Schnitt des Modells anzeigen
en: Show a section of the model
fr: Afficher une coupe du modèle

source: Nascondi
de: Ausblenden
en: Hide
fr: Masquer

source: Nascondi %@
de: %@ ausblenden
en: Hide %@
fr: Masquer %@

source: Nascondi chat
de: Chat ausblenden
en: Hide Chat
fr: Masquer la discussion

source: Nascondi le parti
de: Teile ausblenden
en: Hide parts
fr: Masquer les pièces

source: Nascondi parametri
de: Parameter ausblenden
en: Hide Parameters
fr: Masquer les paramètres

source: Nascondi parametri (⌥⌘I)
de: Parameter ausblenden (⌥⌘I)
en: Hide Parameters (⌥⌘I)
fr: Masquer les paramètres (⌥⌘I)

source: Nel passaggio successivo sceglierai dove creare la cartella del progetto.
de: Im nächsten Schritt wählst du aus, wo der Projektordner erstellt wird.
en: In the next step you’ll choose where to create the project folder.
fr: À l’étape suivante, vous choisirez où créer le dossier du projet.

source: Nessun eseguibile funzionante trovato.
de: Keine funktionierende ausführbare Datei gefunden.
en: No working executable found.
fr: Aucun exécutable fonctionnel trouvé.

source: Nessun model.py da compilare
de: Keine model.py zum Ausführen
en: No model.py to build
fr: Aucun model.py à générer

source: Nessun modello
de: Kein Modell
en: No Model
fr: Aucun modèle

source: Nessun progetto recente
de: Keine benutzten Projekte
en: No Recent Projects
fr: Aucun projet récent

source: Nessuna
de: Keine
en: None
fr: Aucune

source: Nessuna versione salvata
de: Keine gespeicherten Versionen
en: No Saved Versions
fr: Aucune version enregistrée

source: Nome progetto
de: Projektname
en: Project name
fr: Nom du projet

source: Nome progetto:
de: Projektname:
en: Project name:
fr: Nom du projet :

source: Non funzionante
de: Funktioniert nicht
en: Not working
fr: Ne fonctionne pas

source: Non installato
de: Nicht installiert
en: Not installed
fr: Non installé

source: Non trovato
de: Nicht gefunden
en: Not found
fr: Introuvable

source: Non è stato trovato né uv né un Python 3.10–3.13. Installa uv (brew install uv) oppure Python 3.12 e riprova.
de: Weder uv noch Python 3.10–3.13 wurde gefunden. Installiere uv (brew install uv) oder Python 3.12 und versuche es erneut.
en: Neither uv nor Python 3.10–3.13 was found. Install uv (brew install uv) or Python 3.12 and try again.
fr: Ni uv ni Python 3.10–3.13 n’ont été trouvés. Installez uv (brew install uv) ou Python 3.12 et réessayez.

source: Nuovo progetto…
de: Neues Projekt …
en: New Project…
fr: Nouveau projet…

source: Pacchetti: build123d, matplotlib, numpy.
de: Pakete: build123d, matplotlib, numpy.
en: Packages: build123d, matplotlib, numpy.
fr: Paquets : build123d, matplotlib, numpy.

source: Pacchetto esportato
de: Paket exportiert
en: Package exported
fr: Paquet exporté

source: Pagina %lld
de: Seite %lld
en: Page %lld
fr: Page %lld

source: Pagina precedente
de: Vorherige Seite
en: Previous page
fr: Page précédente

source: Pagina successiva
de: Nächste Seite
en: Next page
fr: Page suivante

source: Parametri
de: Parameter
en: Parameters
fr: Paramètres

source: Parametro %@ non trovato in model.py
de: Parameter %@ in model.py nicht gefunden
en: Parameter %@ not found in model.py
fr: Paramètre %@ introuvable dans model.py

source: Parti
de: Teile
en: Parts
fr: Pièces

source: Pausa
de: Pause
en: Pause
fr: Pause

source: Percorso
de: Pfad
en: Path
fr: Chemin

source: Percorso dell’eseguibile:
de: Pfad der ausführbaren Datei:
en: Executable path:
fr: Chemin de l’exécutable :

source: Percorso personalizzato:
de: Eigener Pfad:
en: Custom path:
fr: Chemin personnalisé :

source: Piatto
de: Druckplatte
en: Plate
fr: Plateau

source: Più tardi
de: Später
en: Later
fr: Plus tard

source: Pollici (in)
de: Zoll (in)
en: Inches (in)
fr: Pouces (in)

source: Posizione dei nuovi progetti:
de: Speicherort neuer Projekte:
en: New projects location:
fr: Emplacement des nouveaux projets :

source: Posizione della sezione
de: Schnittposition
en: Section position
fr: Position de la coupe

source: Predefinito dell’agente
de: Standard des Agenten
en: Agent default
fr: Par défaut de l’agent

source: Predefinito di %@
de: Standard von %@
en: %@ default
fr: Par défaut de %@

source: Prepara un file di supporto
de: Bereitet eine Hilfsdatei vor
en: Preparing a helper file
fr: Prépare un fichier auxiliaire

source: Prepara un'anteprima
de: Bereitet eine Vorschau vor
en: Preparing a preview
fr: Prépare un aperçu

source: Pronto
de: Bereit
en: Ready
fr: Prêt

source: Reinstalla…
de: Neu installieren …
en: Reinstall…
fr: Réinstaller…

source: Resina (SLA, DLP, MSLA)
de: Harz (SLA, DLP, MSLA)
en: Resin (SLA, DLP, MSLA)
fr: Résine (SLA, DLP, MSLA)

source: Ricerca di Python 3.10–3.13…
de: Python 3.10–3.13 wird gesucht …
en: Looking for Python 3.10–3.13…
fr: Recherche de Python 3.10–3.13…

source: Riduci
de: Verkleinern
en: Zoom Out
fr: Réduire

source: Riduci (⌘−)
de: Verkleinern (⌘−)
en: Zoom Out (⌘−)
fr: Réduire (⌘−)

source: Rilegge il modello
de: Liest das Modell erneut
en: Reviewing the model
fr: Relit le modèle

source: Rimuovi
de: Entfernen
en: Remove
fr: Supprimer

source: Rimuovi dalla coda
de: Aus der Warteschlange entfernen
en: Remove from queue
fr: Retirer de la file

source: Rimuovi dalla lista
de: Aus Liste entfernen
en: Remove from List
fr: Supprimer de la liste

source: Ripeti
de: Wiederholen
en: Loop
fr: Boucle

source: Ripristina
de: Wiederherstellen
en: Restore
fr: Restaurer

source: Riproduci
de: Abspielen
en: Play
fr: Lire

source: Riproduci l’animazione con la simulazione fisica
de: Animation mit Physiksimulation abspielen
en: Play the animation with the physics simulation
fr: Lire l’animation avec la simulation physique

source: Risposta completata
de: Antwort abgeschlossen
en: Response completed
fr: Réponse terminée

source: SLS (polvere)
de: SLS (Pulver)
en: SLS (powder)
fr: SLS (poudre)

source: Scatola 60×40×25 mm con coperchio a incastro
de: Box 60×40×25 mm mit Schnappdeckel
en: 60×40×25 mm box with a snap-fit lid
fr: Boîte 60×40×25 mm avec couvercle à emboîtement

source: Scegli
de: Auswählen
en: Choose
fr: Choisir

source: Scegli dove creare la cartella “%@”
de: Wähle, wo der Ordner „%@“ erstellt werden soll
en: Choose where to create the folder “%@”
fr: Choisissez où créer le dossier « %@ »

source: Scegli la cartella del progetto da aprire
de: Wähle den zu öffnenden Projektordner
en: Choose the project folder to open
fr: Choisissez le dossier du projet à ouvrir

source: Scegli la pagina della tavola
de: Zeichnungsseite wählen
en: Choose the drawing page
fr: Choisir la page du dessin

source: Scegli le opzioni per il nuovo progetto:
de: Optionen für das neue Projekt auswählen:
en: Choose options for your new project:
fr: Choisissez les options du nouveau projet :

source: Scegli…
de: Auswählen …
en: Choose…
fr: Choisir…

source: Schematica 2D
de: 2D-Zeichnung
en: 2D Drawing
fr: Dessin 2D

source: Scrive il modello
de: Schreibt das Modell
en: Writing the model
fr: Écrit le modèle

source: Scrive un file
de: Schreibt eine Datei
en: Writing a file
fr: Écrit un fichier

source: Scrivi il prossimo messaggio: partirà al termine…
de: Schreib die nächste Nachricht: Sie wird gesendet, sobald diese fertig ist…
en: Write the next message: it goes out when this one finishes…
fr: Écrivez le message suivant : il partira à la fin…

source: Scrivi un messaggio
de: Nachricht schreiben
en: Write a Message
fr: Écrire un message

source: Separa %@
de: %@ lösen
en: Detach %@
fr: Détacher %@

source: Separa dal resto
de: Vom Rest lösen
en: Detach from the rest
fr: Détacher du reste

source: Sezione
de: Schnitt
en: Section
fr: Coupe

source: Sistema i file
de: Ordnet Dateien
en: Tidying up files
fr: Range les fichiers

source: Software open source rilasciato con licenza MIT. Sviluppato da Filippo Finke.
de: Open-Source-Software unter der MIT-Lizenz. Entwickelt von Filippo Finke.
en: Open source software released under the MIT License. Developed by Filippo Finke.
fr: Logiciel open source publié sous licence MIT. Développé par Filippo Finke.

source: Solo immagini
de: Nur Bilder
en: Images only
fr: Images uniquement

source: Sposta il pannello
de: Bereich verschieben
en: Move panel
fr: Déplacer le panneau

source: Sta ragionando · circa %@ token
de: Denkt nach · etwa %@ Token
en: Thinking · about %@ tokens
fr: Réfléchit · environ %@ tokens

source: Staffa a L
de: L-Winkel
en: L bracket
fr: Équerre en L

source: Staffa a L 40×40×3 mm con due fori M4
de: L-Winkel 40×40×3 mm mit zwei M4-Bohrungen
en: 40×40×3 mm L bracket with two M4 holes
fr: Équerre en L 40×40×3 mm avec deux trous M4

source: Stop
de: Stopp
fr: Arrêter

source: Storico delle versioni
de: Versionsverlauf
en: Version history
fr: Historique des versions

source: Studia il riferimento
de: Studiert die Referenz
en: Studying the reference
fr: Étudie la référence

source: Supporto per smartphone inclinato a 60°
de: Smartphone-Ständer mit 60° Neigung
en: Smartphone stand tilted at 60°
fr: Support de smartphone incliné à 60°

source: Tavola tecnica, %@
de: Technische Zeichnung, %@
en: Technical drawing, %@
fr: Dessin technique, %@

source: Tempo dell’animazione
de: Animationszeit
en: Animation time
fr: Temps de l’animation

source: Tieni unita %@
de: %@ verbunden lassen
en: Keep %@ attached
fr: Garder %@ attachée

source: Tieni unita al resto
de: Mit dem Rest verbunden lassen
en: Keep attached to the rest
fr: Garder attachée au reste

source: Tipo di stampante:
de: Druckertyp:
en: Printer type:
fr: Type d’imprimante :

source: Torna a una versione
de: Zu einer Version zurück
en: Go back to a version
fr: Revenir à une version

source: Trascina per spostare il pannello
de: Ziehen, um den Bereich zu verschieben
en: Drag to move the panel
fr: Faites glisser pour déplacer le panneau

source: Tre colonne
de: Drei Spalten
en: Three Columns
fr: Trois colonnes

source: Trovato %@ in %@
de: %@ gefunden in %@
en: Found %@ at %@
fr: %@ trouvé dans %@

source: Un effort più basso fa ragionare meno l’agente prima di agire: le risposte arrivano prima, ma per pezzi complessi potrebbero servire più correzioni.
de: Weniger Aufwand lässt den Agenten vor dem Handeln weniger nachdenken: Antworten kommen schneller, komplexe Teile brauchen aber eventuell mehr Korrekturen.
en: Lower effort makes the agent think less before acting: replies arrive sooner, but complex parts may need more fixes.
fr: Un effort plus faible fait moins réfléchir l’agent avant d’agir : les réponses arrivent plus vite, mais les pièces complexes peuvent demander plus de corrections.

source: Unità di misura:
de: Maßeinheit:
en: Units:
fr: Unité de mesure :

source: Vai al viewer 3D
de: Zum 3D-Viewer
en: Go to 3D Viewer
fr: Aller à la vue 3D

source: Vai alla chat
de: Zum Chat
en: Go to Chat
fr: Aller à la discussion

source: Vai alla schematica 2D
de: Zur 2D-Zeichnung
en: Go to 2D Drawing
fr: Aller au dessin 2D

source: Vale per Claude Code. Il formato json non mostra il testo in streaming né le singole attività, ma può essere utile con versioni che non supportano lo streaming.
de: Gilt für Claude Code. Das json-Format zeigt weder gestreamten Text noch einzelne Schritte, kann aber bei Versionen ohne Streaming helfen.
en: Applies to Claude Code. The json format doesn't stream text or show individual steps, but can help with versions that don't support streaming.
fr: S’applique à Claude Code. Le format json n’affiche ni le texte en continu ni les étapes, mais peut aider avec les versions qui ne gèrent pas le streaming.

source: Valore nella versione a confronto
de: Wert in der verglichenen Version
en: Value in the compared version
fr: Valeur dans la version comparée

source: Velocità
de: Geschwindigkeit
en: Speed
fr: Vitesse

source: Velocità di riproduzione
de: Wiedergabegeschwindigkeit
en: Playback speed
fr: Vitesse de lecture

source: Verifica
de: Prüfen
en: Check
fr: Vérifier

source: Verifica dell’installazione…
de: Installation wird geprüft …
en: Verifying the installation…
fr: Vérification de l’installation…

source: Versione %@
de: Version %@
en: Version %@
fr: Version %@

source: Versione %lld
de: Version %lld
en: Version %lld
fr: Version %lld

source: Versione %lld ripristinata
de: Version %lld wiederhergestellt
en: Version %lld restored
fr: Version %lld restaurée

source: Versione %lld · %@
de: Version %lld · %@
en: Version %lld · %@
fr: Version %lld · %@

source: Versione:
de: Version:
en: Version:
fr: Version :

source: Versioni
de: Versionen
en: Versions
fr: Versions

source: Viewer 3D
de: 3D-Viewer
en: 3D Viewer
fr: Vue 3D

source: Viewer 3D del modello
de: 3D-Modellansicht
en: 3D model viewer
fr: Vue 3D du modèle

source: Vista
de: Ansicht
en: View
fr: Vue

source: Vista da destra
de: Ansicht von rechts
en: Right View
fr: Vue de droite

source: Vista dall’alto
de: Ansicht von oben
en: Top View
fr: Vue de dessus

source: Vista delle parti
de: Teileansicht
en: Parts view
fr: Vue des pièces

source: Vista frontale
de: Vorderansicht
en: Front View
fr: Vue de face

source: Vista isometrica
de: Isometrische Ansicht
en: Isometric View
fr: Vue isométrique

source: Wireframe
de: Drahtgitter
fr: Fil de fer

source: animation.json non è valido: %@
de: animation.json ist ungültig: %@
en: animation.json is not valid: %@
fr: animation.json n’est pas valide : %@

source: build123d e matplotlib non si importano correttamente nell’ambiente creato.
de: build123d und matplotlib lassen sich in der erstellten Umgebung nicht importieren.
en: build123d and matplotlib can’t be imported in the new environment.
fr: build123d et matplotlib ne peuvent pas être importés dans l’environnement créé.

source: completato
de: abgeschlossen
en: completed
fr: terminé

source: in corso
de: läuft
en: in progress
fr: en cours

source: json (risposta unica)
de: json (einzelne Antwort)
en: json (single response)
fr: json (réponse unique)

source: non riuscito
de: fehlgeschlagen
en: failed
fr: échec

source: stream-json (in tempo reale)
de: stream-json (Echtzeit)
en: stream-json (real time)
fr: stream-json (temps réel)

source: “%@” non è una cartella.
de: „%@“ ist kein Ordner.
en: “%@” isn’t a folder.
fr: « %@ » n’est pas un dossier.

source: Layout
fr: Disposition
